# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [2]:
import pandas as pd
company_df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")

In [3]:
# Your code here
company_df.columns = [col.lower().replace(" ","_") for col in company_df.columns]   # Cleaning the name of the columns
company_df.rename(columns={"st":"state"}, inplace=True)      # Changing st to state
company_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [4]:
# Your code here
#- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*

def change_sex(row):            #Function to replace inconsistent values with 'M' and 'F' and Null values with None.
    if row[0] == "m" or  row[0] == "M":
        return "M"  
    elif row[0] == "f" or row[0] == "F":
        return "F"
    else:
        return None
   
company_df["gender"] = company_df["gender"].astype(str)  # converting the datatype of column into string due to error float not subscriptable
company_df["gender"]= company_df["gender"].apply(change_sex)    
company_df["gender"].unique()

array([None, 'F', 'M'], dtype=object)

In [5]:
#- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*

company_df["state"]= company_df["state"].replace(["AZ" ,"WA", "Cali"],["Arizona","Washington","California"])
company_df["state"].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', nan],
      dtype=object)

In [6]:
#- *In education, "Bachelors" could be replaced by "Bachelor"*

company_df["education"]= company_df["education"].replace("Bachelors","Bachelor")   # replacing Bachelors with Bachelor
company_df["education"].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

In [7]:
company_df.dropna(inplace= True)     #removing the null value rows

In [8]:
#- *In Customer Lifetime Value, delete the `%` character*
company_df["customer_lifetime_value"] = company_df["customer_lifetime_value"].astype(str)
company_df["customer_lifetime_value"] = company_df["customer_lifetime_value"].apply(lambda x: x.split("%")[0])
company_df["customer_lifetime_value"] = company_df["customer_lifetime_value"].astype(float)

In [9]:
#- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

company_df["vehicle_class"]= company_df["vehicle_class"].replace(["Sports Car" ,"Luxury SUV", "Luxury Car"],["Luxury","Luxury","Luxury"])

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [361]:
# Your code here
company_df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [10]:
#Cleaning the "number_of_open_complaints" column

company_df["number_of_open_complaints"] = company_df["number_of_open_complaints"].astype(str)       #changing the datatype
company_df["number_of_open_complaints"]= company_df["number_of_open_complaints"].apply(lambda x:x.split('/')[1])   #splitting with "/" , and retaining the 2nd object of the list generated.
company_df["number_of_open_complaints"] = company_df["number_of_open_complaints"].astype(int)       #assigning the datatype integer.
company_df["number_of_open_complaints"].unique()

array([0, 1, 2, 4, 3, 5])

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [11]:
# Your code here
company_df.isnull().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [12]:
company_df.dropna(inplace= True)     #removing the null value rows

In [13]:
company_df["total_claim_amount"] = company_df["total_claim_amount"].round(2)

In [14]:
company_df.sort_values("income", ascending=False).tail(3)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
742,HP55391,Oregon,M,Master,542613.62,0.0,71.0,0,Corporate Auto,Four-Door Car,408.00
739,KR43119,California,M,College,450666.02,0.0,66.0,0,Personal Auto,Four-Door Car,316.80
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.46

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [22]:
# Your code here
company_df.duplicated().sum()    #the total number of duplicated values is 0, hence there are no duplicates.

0

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [2]:
# Your code here
def clean_data():                                                                                                   # Defining a function to clean data
    company_df.columns = [col.lower().replace(" ","_") for col in company_df.columns]                               # Cleaning the name of the columns
    company_df.rename(columns={"st":"state"}, inplace=True)                                                         # Changing st to state
    def change_sex(row):                                                                                            #Function to replace inconsistent values with 'M' and 'F' and Null values with None.
        if row[0] == "m" or  row[0] == "M":
            return "M"  
        elif row[0] == "f" or row[0] == "F":
            return "F"
        else:
            return None
    
    company_df["gender"] = company_df["gender"].astype(str)                                                          # converting the datatype of column into string due to error float not subscriptable
    company_df["gender"]= company_df["gender"].apply(change_sex)    
    company_df["state"]= company_df["state"].replace(["AZ" ,"WA", "Cali"],["Arizona","Washington","California"])
    company_df["education"]= company_df["education"].replace("Bachelors","Bachelor")                                 # replacing Bachelors with Bachelor
    company_df.dropna(inplace= True)                                                                                 #removing the null value rows
    company_df["customer_lifetime_value"] = company_df["customer_lifetime_value"].astype(str)                        # *In Customer Lifetime Value, delete the `%` character*
    company_df["customer_lifetime_value"] = company_df["customer_lifetime_value"].apply(lambda x: x.split("%")[0])
    company_df["customer_lifetime_value"] = company_df["customer_lifetime_value"].astype(float)
    company_df["vehicle_class"]= company_df["vehicle_class"].replace(["Sports Car" ,"Luxury SUV", "Luxury Car"],["Luxury","Luxury","Luxury"]) #- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*
    company_df["number_of_open_complaints"] = company_df["number_of_open_complaints"].astype(str)                    #changing the datatype
    company_df["number_of_open_complaints"]= company_df["number_of_open_complaints"].apply(lambda x:x.split('/')[1]) #splitting with "/" , and retaining the 2nd object of the list generated.
    company_df["number_of_open_complaints"] = company_df["number_of_open_complaints"].astype(int)                    #assigning the datatype integer.
    company_df["total_claim_amount"] = company_df["total_claim_amount"].round(2)
    return
    
clean_data()                                                                                                         # calling the function

In [16]:
company_df.head(30)
#company_df.shape
company_df["vehicle_class"].unique()
company_df.nunique()

customer                     952
state                          5
gender                         2
education                      5
customer_lifetime_value      921
income                       688
monthly_premium_auto         128
number_of_open_complaints      6
policy_type                    3
vehicle_class                  4
total_claim_amount           680
dtype: int64

In [17]:
company_df.shape
company_df.nunique()

customer                     952
state                          5
gender                         2
education                      5
customer_lifetime_value      921
income                       688
monthly_premium_auto         128
number_of_open_complaints      6
policy_type                    3
vehicle_class                  4
total_claim_amount           680
dtype: int64

In [2]:
# Enable autoreload
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [11]:
import data_cleaning
import pandas as pd
company_df2 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")

In [13]:
cleaned_df = data_cleaning.main(company_df2)
cleaned_df

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,0,Master,0,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
1067,VJ51327,Cali,F,High School or Below,2031499.76%,63209.0,102.0,1/2/00,Personal Auto,SUV,207.320041
1068,GS98873,Arizona,F,Bachelor,323912.47%,16061.0,88.0,1/0/00,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,462680.11%,79487.0,114.0,1/0/00,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,899704.02%,54230.0,112.0,1/0/00,Personal Auto,Two-Door Car,537.600000
1071,0,0,0,0,0,0.0,0.0,0,0,0,0.000000

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [20]:
# Your code here
df_desc = company_df.describe().round(2)
df_desc

,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount
count,952.00,952.00,952.00,952.00,952.00
mean,794201.29,39557.35,205.23,0.38,405.00
std,625879.16,30744.56,1697.75,0.87,299.24
min,200435.07,0.00,61.00,0.00,0.38
25%,411783.58,13087.75,68.00,0.00,196.73
50%,588574.53,36632.00,83.00,0.00,350.40
75%,903750.92,65085.50,110.00,0.00,534.00
max,4479546.94,99960.00,35354.00,5.00,2893.24